In [60]:
import numpy as np
import pandas as pd

# Creating Series using pandas:

You can convert a list, numpy array or dictionary to a series:

In [61]:
lables = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [62]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [63]:
pd.Series(data=my_list,index=lables)

a    10
b    20
c    30
dtype: int64

In [64]:
pd.Series(my_list,lables)

a    10
b    20
c    30
dtype: int64

In [65]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [66]:
pd.Series(arr,lables)

a    10
b    20
c    30
dtype: int32

In [67]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

# Using an Index:

In [69]:
ser1 = pd.Series([1,2,3,4],index = ['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [70]:
ser2 = pd.Series([1,2,5,4],index = ['USA','Germany','India','Japan'])
ser2

USA        1
Germany    2
India      5
Japan      4
dtype: int64

In [71]:
ser1['USA']

1

In [72]:
ser2['India']

5

In [73]:
ser1 + ser2

Germany    4.0
India      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [74]:
ser1 * ser2

Germany     4.0
India       NaN
Japan      16.0
USA         1.0
USSR        NaN
dtype: float64

# Operations:

In [77]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [78]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [79]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [80]:
df['col2']

0    444
1    555
2    666
3    444
Name: col2, dtype: int64

In [81]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [82]:
df['col2'].nunique()

3

In [83]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [84]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [85]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [86]:
df['col2']==444

0     True
1    False
2    False
3     True
Name: col2, dtype: bool

In [87]:
df[df['col2']==444]

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

In [88]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [89]:
def square(x):
    return x*x

In [90]:
df['col1'].apply(square)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [91]:
def times2(x):
    return x*2

In [92]:
df['col3'].apply(times2)

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: col3, dtype: object

In [93]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [94]:
df['col1'].sum()

10

In [95]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [96]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [97]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [98]:
 df.dropna() #If null value is there it will skip

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [99]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],'col2':[np.nan,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [100]:
df.isnull()

    col1   col2   col3
0  False   True  False
1  False  False  False
2  False  False  False
3   True  False  False

In [101]:
df.fillna('No num')

     col1    col2 col3
0       1  No num  abc
1       2     555  def
2       3     666  ghi
3  No num     444  xyz

In [102]:
data = {'A':['foo','foo','foo','bar','bar','bar'],'B':['one','one','two','two','one','one',], 'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [103]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [104]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Group by

In [105]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [106]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [107]:
com = df.groupby('Company')
com

In [108]:
com.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [109]:
com.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [110]:
com.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [111]:
com.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [112]:
com.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [113]:
com.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [114]:
com.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [115]:
com.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [116]:
salesreport = com.describe().transpose()

In [117]:
salesreport

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [118]:
salesreport.to_csv("SalesReport.csv")

In [119]:
salesreport.to_excel("SalesReport.xlsx")

# .loc and .iloc

In [120]:
df = pd.DataFrame([1,2,3,4,5,6,7,8,9,10],index=[49,48,47,46,45,1,2,3,4,5])
df

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
5   10

In [121]:
df.loc[0]

KeyError: 0

In [122]:
df.loc[49] #Location(Assigned indexing value)

0    1
Name: 49, dtype: int64

In [123]:
df.iloc[0]

0    1
Name: 49, dtype: int64

In [125]:
df.iloc[1] #Index Location(0,1,2,3...)

0    2
Name: 48, dtype: int64